Revit 2027 API
PointLoad.Create Method
Overload List
Name | Description
Create(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType) |  Creates a new hosted point load within the project.
Create(Document, ElementId, XYZ, XYZ, XYZ, PointLoadType) |  Creates a new custom hosted point load within the project using data at point.
Top
See Also
Reference
PointLoad Class
Autodesk.Revit.DB.Structure Namespace